{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "Hugofernandez/Mistral-7B-v0.1-colab-sharded",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "k_proj",
    "o_proj",
    "q_proj",
    "lm_head",
    "gate_proj",
    "down_proj",
    "v_proj",
    "up_proj"
  ],
  "task_type": "CAUSAL_LM"
}